Autodesk.Revit.DB.DimensionShape
An enumerated type to list dimension type.

Autodesk.Revit.DB.DimensionShape.Unknown
Unknown type dimension.

Autodesk.Revit.DB.DimensionShape.Diameter
Diameter dimension.

Autodesk.Revit.DB.DimensionShape.Spot
Spot dimension.

Autodesk.Revit.DB.DimensionShape.ArcLength
ArcLength dimension.

Autodesk.Revit.DB.DimensionShape.Radial
Radial dimension.

Autodesk.Revit.DB.DimensionShape.Angular
Angular dimension.

Autodesk.Revit.DB.DimensionShape.Linear
Linear dimension.